yiqingchen-h/-/projects/06-ccs-m0-smart-car/版本演进/v1.2A_完成大部分功能总线云台/Stepping_Trace_1.2/Stepping_Trace.syscfg
GPIO5.$name                              = "LED";
GPIO5.associatedPins.create(3);
GPIO5.associatedPins[0].$name            = "Red";
GPIO5.associatedPins[0].internalResistor = "PULL_UP";
GPIO5.associatedPins[0].assignedPort     = "PORTB";
GPIO5.associatedPins[0].assignedPin      = "6";
GPIO5.associatedPins[1].$name            = "Blue";
GPIO5.associatedPins[1].assignedPort     = "PORTB";
GPIO5.associatedPins[1].assignedPin      = "27";
GPIO5.associatedPins[1].internalResistor = "PULL_UP";
GPIO5.associatedPins[2].$name            = "Green";
GPIO5.associatedPins[2].assignedPort     = "PORTB";
GPIO5.associatedPins[2].assignedPin      = "23";
GPIO5.associatedPins[2].internalResistor = "PULL_UP";

GPIO6.$name                          = "Stepping_Gimbal_GPIO";
GPIO6.associatedPins.create(4);
GPIO6.associatedPins[0].assignedPort = "PORTB";
GPIO6.associatedPins[0].$name        = "Gimbal_DIR_Up";
GPIO6.associatedPins[0].assignedPin  = "18";
GPIO6.associatedPins[1].assignedPort = "PORTB";
GPIO6.associatedPins[1].$name        = "Gimbal_EN_Up";
GPIO6.associatedPins[1].assignedPin  = "19";
GPIO6.associatedPins[2].$name        = "Gimbal_EN_Down";
GPIO6.associatedPins[2].assignedPort = "PORTA";
GPIO6.associatedPins[2].assignedPin  = "24";
GPIO6.associatedPins[3].assignedPort = "PORTA";
GPIO6.associatedPins[3].$name        = "Gimbal_DIR_Down";
GPIO6.associatedPins[3].assignedPin  = "13";

GPIO7.$name                          = "Electromagnets_IO";
GPIO7.associatedPins[0].assignedPort = "PORTB";
GPIO7.associatedPins[0].$name        = "PB17";

I2C1.$name                           = "I2C_0";
I2C1.basicEnableController           = true;
I2C1.basicControllerStandardBusSpeed = "Fast";
I2C1.sdaPinConfig.$name              = "ti_driverlib_gpio_GPIOPinGeneric4";
I2C1.sdaPinConfig.enableConfig       = true;
I2C1.sdaPinConfig.internalResistor   = "PULL_UP";
I2C1.sclPinConfig.$name              = "ti_driverlib_gpio_GPIOPinGeneric5";
I2C1.sclPinConfig.enableConfig       = true;
I2C1.sclPinConfig.internalResistor   = "PULL_UP";

PWM1.timerCount                         = 1;
PWM1.pwmMode                            = "EDGE_ALIGN_UP";
PWM1.interrupts                         = ["ZERO_EVENT"];
PWM1.ccIndex                            = [1];
PWM1.clockPrescale                      = 32;
PWM1.interruptPriority                  = "1";
PWM1.$name                              = "Stepping_STEP_L";
PWM1.peripheral.$assign                 = "TIMA0";
PWM1.peripheral.ccp1Pin.$assign         = "PB20";
PWM1.ccp1PinConfig.direction            = scripting.forceWrite("OUTPUT");
PWM1.ccp1PinConfig.hideOutputInversion  = scripting.forceWrite(false);
PWM1.ccp1PinConfig.onlyInternalResistor = scripting.forceWrite(false);
PWM1.ccp1PinConfig.passedPeripheralType = scripting.forceWrite("Digital");
PWM1.ccp1PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric1";
PWM1.PWM_CHANNEL_1.$name                = "ti_driverlib_pwm_PWMTimerCC0";

PWM2.ccIndex                            = [0];
PWM2.clockPrescale                      = 32;
PWM2.timerCount                         = 1;
PWM2.pwmMode                            = "EDGE_ALIGN_UP";
PWM2.interrupts                         = ["ZERO_EVENT"];
PWM2.$name                              = "Stepping_STEP_R";
PWM2.peripheral.$assign                 = "TIMG0";
PWM2.peripheral.ccp0Pin.$assign         = "PA23";
PWM2.PWM_CHANNEL_0.$name                = "ti_driverlib_pwm_PWMTimerCC1";
PWM2.ccp0PinConfig.direction            = scripting.forceWrite("OUTPUT");
PWM2.ccp0PinConfig.hideOutputInversion  = scripting.forceWrite(false);
PWM2.ccp0PinConfig.onlyInternalResistor = scripting.forceWrite(false);
PWM2.ccp0PinConfig.passedPeripheralType = scripting.forceWrite("Digital");
PWM2.ccp0PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric6";

PWM3.timerCount                         = 1;
PWM3.pwmMode                            = "EDGE_ALIGN_UP";
PWM3.interrupts                         = ["ZERO_EVENT"];
PWM3.clockPrescale                      = 32;
PWM3.$name                              = "Stepping_Gimbal_STEP_Up";
PWM3.interruptPriority                  = "0";
PWM3.ccIndex                            = [1];
PWM3.peripheral.$assign                 = "TIMG6";
PWM3.peripheral.ccp1Pin.$assign         = "PA30";
PWM3.ccp1PinConfig.direction            = scripting.forceWrite("OUTPUT");
PWM3.ccp1PinConfig.hideOutputInversion  = scripting.forceWrite(false);
PWM3.ccp1PinConfig.onlyInternalResistor = scripting.forceWrite(false);
PWM3.ccp1PinConfig.passedPeripheralType = scripting.forceWrite("Digital");
PWM3.ccp1PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric15";
PWM3.PWM_CHANNEL_1.$name                = "ti_driverlib_pwm_PWMTimerCC2";

PWM4.timerCount                         = 1;
PWM4.pwmMode                            = "EDGE_ALIGN_UP";
PWM4.interrupts                         = ["ZERO_EVENT"];
PWM4.clockPrescale                      = 32;
PWM4.$name                              = "Stepping_Gimbal_STEP_Down";
PWM4.interruptPriority                  = "0";
PWM4.ccIndex                            = [0];
PWM4.peripheral.$assign                 = "TIMG8";
PWM4.peripheral.ccp0Pin.$assign         = "PB21";
PWM4.PWM_CHANNEL_0.$name                = "ti_driverlib_pwm_PWMTimerCC4";
PWM4.ccp0PinConfig.direction            = scripting.forceWrite("OUTPUT");
PWM4.ccp0PinConfig.hideOutputInversion  = scripting.forceWrite(false);
PWM4.ccp0PinConfig.onlyInternalResistor = scripting.forceWrite(false);
PWM4.ccp0PinConfig.passedPeripheralType = scripting.forceWrite("Digital");
PWM4.ccp0PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric14";

PWM5.$name                              = "PWM_Servos";
PWM5.ccIndex                            = [0];
PWM5.clockPrescale                      = 100;
PWM5.timerCount                         = 6400;
PWM5.pwmMode                            = "EDGE_ALIGN_UP";
PWM5.peripheral.$assign                 = "TIMA1";
PWM5.peripheral.ccp0Pin.$assign         = "PA15";
PWM5.PWM_CHANNEL_0.$name                = "ti_driverlib_pwm_PWMTimerCC3";
PWM5.ccp0PinConfig.direction            = scripting.forceWrite("OUTPUT");
PWM5.ccp0PinConfig.hideOutputInversion  = scripting.forceWrite(false);
PWM5.ccp0PinConfig.onlyInternalResistor = scripting.forceWrite(false);
PWM5.ccp0PinConfig.passedPeripheralType = scripting.forceWrite("Digital");
PWM5.ccp0PinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric11";

SYSCTL.forceDefaultClkConfig = true;

TIMER1.timerClkDiv        = 8;
TIMER1.timerMode          = "PERIODIC";
TIMER1.interrupts         = ["ZERO"];
TIMER1.interruptPriority  = "0";
TIMER1.$name              = "Trace_Timer";
TIMER1.timerPeriod        = "5ms";
TIMER1.peripheral.$assign = "TIMG7";

UART1.$name                    = "UART_0";
UART1.enabledInterrupts        = ["RX"];
UART1.targetBaudRate           = 115200;
UART1.interruptPriority        = "1";
UART1.peripheral.$assign       = "UART0";
UART1.peripheral.rxPin.$assign = "PA1";
UART1.peripheral.txPin.$assign = "PA0";
UART1.txPinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric0";
UART1.rxPinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric2";

UART2.$name                            = "UART_3_R";
UART2.targetBaudRate                   = 115200;
UART2.enabledInterrupts                = ["RX"];
UART2.interruptPriority                = "0";
UART2.peripheral.$assign               = "UART3";
UART2.peripheral.rxPin.$assign         = "PB3";
UART2.peripheral.txPin.$assign         = "PB2";
UART2.txPinConfig.direction            = scripting.forceWrite("OUTPUT");
UART2.txPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART2.txPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART2.txPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART2.txPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric3";
UART2.rxPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART2.rxPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART2.rxPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART2.rxPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric7";

